Data Analysis

In [1]:
import pandas as pd

In [2]:
user = pd.read_csv('../data/raw/user_table.csv')
user.head()

   user_id        date   device     sex
0   450007  2015-02-28  Desktop  Female
1   756838  2015-01-13  Desktop    Male
2   568983  2015-04-09  Desktop    Male
3   190794  2015-02-18  Desktop  Female
4   537909  2015-01-15  Desktop    Male

In [3]:
print(user.dtypes)
print(user.isnull().sum())

user_id     int64
date       object
device     object
sex        object
dtype: object
user_id    0
date       0
device     0
sex        0
dtype: int64

In [4]:
user.head(5)

   user_id        date   device     sex
0   450007  2015-02-28  Desktop  Female
1   756838  2015-01-13  Desktop    Male
2   568983  2015-04-09  Desktop    Male
3   190794  2015-02-18  Desktop  Female
4   537909  2015-01-15  Desktop    Male

In [5]:
print(user.dtypes)

user_id     int64
date       object
device     object
sex        object
dtype: object

In [6]:
user.to_csv('../data/processed/user_table.csv', index=False)